tests/threading/multi-thread-siege
$ siege -c 300 -b -t20s http://localhost:3001/blocks

output

** SIEGE 3.0.8
** Preparing 300 concurrent users for battle.
The server is now under siege...
Lifting the server siege...      done.

Transactions:		       80939 hits
Availability:		      100.00 %
Elapsed time:		       19.50 secs
Data transferred:	        4.09 MB
Response time:		        0.07 secs
Transaction rate:	     4150.72 trans/sec
Throughput:		        0.21 MB/sec
Concurrency:		      298.92
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.22
Shortest transaction:	        0.00